app/Repositories/User/UserRepositoryImplement.php

    public function findById(int $id): ?User
    {
        return User::find($id);
---
SELECT * FROM `users` WHERE `users`.`id` = 11 LIMIT 1